# Класс может содержать свойства (набор объектов) и методы (набор функций для работы с классом и его объектами)
#
# Класс - единая целостная конструкция
#
# Инкапсуляция:
# Данные и методы класса можно скрывать, чтобы пользователь не мог случайно вмешаться в работу класса из вне напрямую
# Работать с классом можно только через публичные разрешенные методы
#
# Наследование:
# Дочерние классы наследуют свойства базового класса
# Можно использоваться ранее созданные классы и расширять их функциональность
#
# Полиморфизм - возможность через единый интерфейс работать с объектами разных классов
# Параметрический  полиморфизм - оперирование разными типами объектов через их единый базовый класс
# Запуская метод в базовом классе для каждого объекта будет запускаться функция из соответствующего дочернего класса
#
